#include <stdio.h>;

int main()
{
	int K,Q,R,B,N,P;
	scanf("%d %d %d %d %d %d",&K,&Q,&R,&B,&N,&P);
	
	if(K != 1)
	{
		if (K >= 0)
		{
			K = (1 - K);
		}
		
	}
	else
	{
		K = 0;
	}
	
	//////////////위에가 킹 체스말//////////////////// 
	
	if(Q != 1)
	{
		if (Q >= 0)
		{
			Q = (1 - Q);
		}
	}
	else
	{
		Q = 0;
	}
	
	//////////////위에가 퀸 체스말//////////////////// 
	
	if(R != 2)
	{
		if(R >= 0)
		{
			R = (2 - R);
		}
	}
	else
	{
		R = 0;
	}
	
	//////////////위에가 룩 체스말////////////////////  	
		
	if(B != 2)
	{
		if(B >= 0)
		{
			B = (2 - B);
		}
	}
	else
	{
		B = 0;
	}
	
	//////////////위에가 비숍 체스말//////////////////// 
		
	if(N != 2)
	{
		if(N >= 0)
		{
			N = ( 2 - N );
		}
	}
	else
	{
		N = 0;
	}	
	//////////////위에가 나이트 체스말//////////////////// 
	
	if(P != 8)
	{
		if(P >= 0)
		{
			P = 8 - P;
		}
	}
		
	else
	{
		P = 0;
	}
	
	
	printf("%d %d %d %d %d %d",K,Q,R,B,N,P);
	 
}
